PLAYER_STARTED = "👋 Игрок @{username} запустил бота!"

PLAYER_STATS_SUCCESS = "🚀 Игрок @{username} получил свою статистику."

PLAYER_STATS_NO_GAMES = "🚀 Игрок @{username} пытался получить статистику, ни разу не сыграв."

PLAYER_STATS_UNREGISTERED = "🚀 Игрок @{username} пытался получить статистику, будучи не авторизованным."

PLAYER_LEADERBOARD_EMPTY = "🚀 Игрок @{username} пытался получить рейтинг, но он пуст."

PLAYER_LEADERBOARD_SUCCESS = "🚀 Игрок @{username} получил рейтинг игроков."

PLAYER_ELO_INFO_VIEWED = "🚀 Игрок @{username} посмотрел правила начисления рейтинга."
