START_MESSAGE = ("👋 <b>Привет! Добро пожаловать в Морской бой!</b>\n\n"
                 "🚢 Создай новую игру и приглашай друга — или присоединяйся к уже созданной. Удачи в бою!\n\n"
                 "👨‍💻 <b>Разработчик:</b> @vladelo\n"
                 "🌐 <b>GitHub проекта:</b> <a href='https://github.com/vladelo777/Sea-Battle-Bot'>github.com</a>"
                 )

STARTING_GAME = "🛠 Игра создана! ID игры: {game_id}\n Ожидаем второго игрока."

STARTING_GAME_ERROR = "❗ Прежде чем создать новую игру, доиграйте текущую или сдайтесь."

CHOOSE_CONNECTING_GAME = "💬 Выберите и отправьте ID игры, к которой хотите присоединиться."

JOIN_CONNECTING_GAME_ERROR = "❗ Нельзя подключаться к своей же игре."

ELO_INFO = ("📊 <b>Как считается рейтинг?</b>\n\n"
            "Система основана на алгоритме <b>Elo</b> — популярной модели оценки навыков игроков.\n\n"
            "☝🏻 <b>Основные принципы:</b>\n"
            "• Стартовый рейтинг каждого игрока: <b>1000</b>.\n"
            "• После каждой игры рейтинг <b>перерасчитывается</b>:\n"
            "   • Победитель получает очки (больше — если противник сильнее).\n"
            "   • Проигравший теряет очки (больше — если противник слабее).\n\n"
            "📈 Рейтинг — это отражение твоей формы и уровня среди других игроков.\n\n"
            "🔁 Пересчёт происходит <b>после каждой завершённой игры</b>."
            )
